//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1987-2013, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************

//**********************************************************************
//<AMI_FHDR_START>
//
// Name:	AmiTxtInfoSetup.uni
//
// Description:	AmiTxtInfoSetup.uni unicode description.
//
//<AMI_FHDR_END>
//**********************************************************************
/=#
#include "VFR.uni"

//
// AmiTxtPei Configuration
//
//#string STR_CPUTXT_ENABLED                     #language eng "Enabled"
//#string STR_CPUTXT_DISABLED                    #language eng "Disabled"

#string STR_CPUTXT_FORM			#language eng "Intel TXT Information"
#string STR_CPUTXT_HELP			#language eng "Display Intel TXT information"

#string STR_CPUTXT_CHIP_FUSE_STRING		#language eng "Chipset"
#string STR_CPUTXT_CHIP_FUSE_HELP		#language eng "Chipset is production or debug Fused"
#string STR_CPUTXT_CHIP_FUSE_VALUE		#language eng "Debug Fused"

#string STR_CPUTXT_CHIP_SUPPORT_STRING	#language eng "Chipset Txt"
#string STR_CPUTXT_CHIP_SUPPORT_HELP	#language eng "Chipset support Txt"
#string STR_CPUTXT_CHIP_SUPPORT_VALUE	#language eng "Not Supported"

#string STR_CPUTXT_CPU_SUPPORT_STRING	#language eng "Cpu Txt"
#string STR_CPUTXT_CPU_SUPPORT_HELP		#language eng "Cpu support Txt"
#string STR_CPUTXT_CPU_SUPPORT_VALUE	#language eng "Not Supported"

#string STR_CPUTXT_ERROR_CODE_STRING	#language eng "Error Code"
#string STR_CPUTXT_ERROR_CODE_HELP		#language eng "This holds the Intel TXT shutdown error code."
#string STR_CPUTXT_ERROR_CODE_VALUE		#language eng "None"

#string STR_CPUTXT_CLASS_CODE_STRING	#language eng "  Class Code"
#string STR_CPUTXT_CLASS_CODE_HELP		#language eng "Error code[9:4]"
#string STR_CPUTXT_CLASS_CODE_VALUE		#language eng "None"

#string STR_CPUTXT_MAJOR_CODE_STRING	#language eng "  Major Code"
#string STR_CPUTXT_MAJOR_CODE_HELP		#language eng "Error code[14:10]"
#string STR_CPUTXT_MAJOR_CODE_VALUE		#language eng "None"

#string STR_CPUTXT_MINOR_CODE_STRING	#language eng "  Minor Code"
#string STR_CPUTXT_MINOR_CODE_HELP		#language eng "Error code[24:16]"
#string STR_CPUTXT_MINOR_CODE_VALUE		#language eng "None"

//#string <string name> #language eng ""

//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1987-2013, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************
